/**
 * Created by yixian on 14-1-15.
 */
define(['dataEngine'], function (engine) {
    var categories = {
        investigationtype: {
            0: '矛盾纠纷',
            1: '治安突出问题',
            2: '信访突出问题',
            3: '公共安全',
            4: '非法活动场所',
            5: '群体性突发事件',
            6: '其他'
        },
        investigateproblemstatus: {
            0: '未处理',
            1: '已处理'
        },
        usersex:{
            0:'男',
            1:'女'
        },
        cardtype:{
            0:'身份证',
            1:'军官证',
            2:'学生证',
            3:'其他'
        },
        cultuerlev:{
            0:'大专',
            1:'本科',
            2:'研究生',
            3:'博士'
        },
        casetype:{
            0:'民事',
            1:'刑事',
            2:'行政'
        },
        lawstatus:{
            0:'一审',
            1:'二审'
        },
        casestatus:{
            0:'办理中',
            1:'已办结',
            2:'待办'
        },
        lawyertype:{
            0:'专职',
            1:'兼职'

        },
        degree:{
            0:'学士学位',
            1:'硕士学位',
            2:'博士学位'
        },
        feeyear:{
            0:'减半',
            1:'全免'
        },
        nation:{
            0:'汉族',
            1:'满族',
            2:'回族',
            3:'维吾尔族'
        },
        politicyparty:{
            0:'中国共产党',
            1:'国民党',
            2:'民主同盟',
            3:'民主建国会',
            4:'九三学社'
        },
        laywerpost:{
            0:'专职律师',
            1:'兼职律师',
            2:'初级律师',
            3:'中级律师',
            4:'高级律师',
            5:'海外律师'
        },
        socialwelfare:{
            0:'全选',
            1:'养老',
            2:'医疗',
            3:'工伤',
            4:'失业',
            5:'生育'
        },
        feetype:{
            0:'减半',
            1:'全免'
        },
        siFaJu:{
            0:'天津市司法局',
            1:'天津市南开区司法局',
            2:'天津市河西区司法局'
        },
        orgForm:{
            0:'国资所',
            1:'个人所',
            2:'普通合伙所',
            3:'特殊的普通合伙所'
        },
        status:{
            0:'审批中',
            1:'已办结'
        },
        practiceStatus:{
           0:'实习中',
           1:'实习期满'
        },
        applyPracticeStatus:{
           0:'待办',
           1:'实习中',
           2:'办结（不通过）'
        },
        ispunished:{
            0:'是',
            1:'否'
        },
        licenceType:{
            0:'正本',
            1:'副本'
        },
        lose:{
            0:'遗失',
            1:'毁损'
        },
        areacode:{
            120000:'天津市',
            120100:'市辖区',
            120101:'和平区',
            120102:'河东区',
            120103:'河西区',
            120104:'南开区',
            120105:'河北区',
            120106:'红桥区',
            120110:'东丽区',
            120111:'西青区',
            120112:'津南区',
            120113:'北辰区',
            120114:'武清区',
            120115:'宝坻区',
            120116:'滨海新区',
            120221:'宁河县',
            120223:'静海县',
            120225:'蓟县'
        },
        examine:{
            0:'称职',
            1:'基本称职',
            2:'不评定等次',
            3:'暂缓考核',
            4:'未审批'
        },
        result:{
            0:'合格',
            1:'不合格',
            2:'暂缓考核',
            3:'不评定等次',
            4:'未审批'
        },
        political:{
            0:'无',
            1:'团员',
            2:'共产党员'
        },
        lawOfficeNature:{
            0:'个人律师事务所',
            1:'普通合伙律师事务所',
            2:'特殊的普通合伙律师事务所'

        },
        name:{

        }
    }

    engine.dataMap['sys/categories'] = {
        'get': function (param) {
            return {success: true, data: categories};
        }
    }
});